app/controllers/graphs_controller.rb

  def upload
    x_coordinates = CSV.open(params[:file].path, 'r') { |csv| csv.first }
    x_coordinates.shift
    @graph = Graph.new
    @graph.labels = x_coordinates.to_s
    y_coordinates = []
      CSV.foreach(params[:file].path, headers:false) do |row|
       y_coordinates << row
    end
    y_coordinates.map do |row|
      row.shift
    end
    arr = []
    for i in 1..y_coordinates.length
      arr.push(0)
    end
    i = 0
    y_coordinates.each do |row|
      row.each do |v|
        arr[i] += v.to_i
        if i == y_coordinates.length - 1
          i = 0
        else
          i+=1
        end
      end
    end
    binding.pry
    @graph.data = arr.to_s
    @graph.save
---
INSERT INTO "graphs" ("user_id", "data_label", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["data_label", "POINTS"], ["title", "CHART TITLE "], ["description", "wefwef"], ["created_at", 2016-12-07 20:56:29 UTC], ["updated_at", 2016-12-07 20:56:29 UTC]]

  def index
    if params[:user_id]
      @graphs = Graph.find(params[:user_id])
---
SELECT  "graphs".* FROM "graphs" WHERE "graphs"."user_id" = ? AND "graphs"."id" = ? LIMIT ?  [["user_id", 3], ["id", 32], ["LIMIT", 1]]