app/controllers/graphs_controller.rb

  def show
    @graph = current_user.graphs.find(params[:id])
---
SELECT  "graphs".* FROM "graphs" WHERE "graphs"."user_id" = ? AND "graphs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]

  def edit
    @graph = Graph.find(params[:id])
---
SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]

  def update
    @graph = current_user.graphs.find(params[:id])
    updated_data = params["graphData"].values
    csv_parser = CsvParser.new
    csv_parser.update_data(@graph,updated_data)
---
SELECT  "graphs".* FROM "graphs" WHERE "graphs"."user_id" = ? AND "graphs"."id" = ? LIMIT ?  [["user_id", 3], ["id", 32], ["LIMIT", 1]]
UPDATE "graphs" SET "data" = ?, "updated_at" = ? WHERE "graphs"."id" = ?  [["data", "[\"11\", \"15\", \"27\", \"87\", \"30\"]"], ["updated_at", 2016-12-05 20:49:25 UTC], ["id", 32]]