app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "bob"]]
---
 def index
   if params[:inserted_name]
     @users = User.where(name: params[:inserted_name])